# Titanic Data Cleaning and Quality Assessment

This notebook contains my Python solution to a data quality and preprocessing task using a subset of the classic Titanic dataset (`titanic_training.csv`). The focus is on identifying and handling missing values and data inconsistencies in preparation for further analysis or modeling.

## Objective

Using `pandas` and `numpy`, this notebook:

- Reads in the Titanic training data from `titanic_training.csv`.
- Assesses data quality issues such as **missing values** and **inconsistent values**.
- Cleans the dataset by handling missing data and correcting inconsistencies.
- Exports the cleaned version of the dataset to a new CSV file.

## Data Description

Each row represents a passenger. The main fields used are:

- **pclass** – Ticket class (1 = 1st, 2 = 2nd, 3 = 3rd)  
- **survived** – Survival (0 = No, 1 = Yes)  
- **sex** – Passenger sex (`male`, `female`)  
- **age** – Age in years  
- **sibsp** – Number of siblings/spouses aboard  
- **parch** – Number of parents/children aboard  
- **fare** – Passenger fare  
- **embarked** – Port of embarkation (`C` = Cherbourg, `Q` = Queenstown, `S` = Southampton)

## Tasks Performed

1. **Load the data**

   - Read the Titanic dataset from `titanic_training.csv` using `pandas.read_csv()`.

2. **Assess missing values and inconsistencies**

   - Generate a summary table for each feature showing:
     - Number of missing values (MV) and percentage of MV.
     - Number of inconsistent values (IV) and percentage of IV.
   - Examples of inconsistencies include:
     - `sex` values with incorrect casing (e.g., `"Male"` instead of `"male"`).
     - `embarked` values written as full names (e.g., `"Queenstown"` instead of `"Q"`).

3. **List problematic records**

   - Display all records containing **missing** and/or **inconsistent** values.

4. **Handle missing values**

   - For **numeric features** (e.g., `age`, `fare`), fill missing values using the **feature mean**.
   - For **categorical/ordinal features** (e.g., `sex`, `embarked`, `pclass`), fill missing values using the **feature mode**.

5. **Correct inconsistent values**

   - Standardize the `sex` column to lower-case values (`"male"`, `"female"`).
   - Standardize the `embarked` column to valid abbreviations only (`"C"`, `"Q"`, `"S"`).
   - Apply similar corrections for any other detected inconsistencies.

6. **Export cleaned data**

   - Save the cleaned dataset to a CSV file (e.g., `titanic_clean.csv`) in the same folder as the notebook.

---

This notebook demonstrates essential data cleaning steps that are common in real-world data analytics workflows: detecting data quality issues, systematically handling missing values, and enforcing consistent categories.

---

In [1]:
#Importing the needed libraries and alias them
import numpy as np
import pandas as pd

In [2]:
# Read data from a CSV file into a pandas dataframe
data = pd.read_csv('titanic_training.csv')

In [3]:
# Display the first few rows of the dataframe
data.head()

   ID  pclass     sex   age  sibsp  parch  fare embarked  survived
0   1       3    male  20.0      0      0   4.0        C         0
1   2       3  female  18.0      0      0   7.2        C         1
2   3       2    male   NaN      0      0  15.6        C         0
3   4       2    male   NaN      0      0   0.0        S         0
4   5       3  female   2.0      3      2  27.9        S         0

In [4]:
# Display the last few rows of the dataframe
data.tail()

      ID  pclass     sex   age  sibsp  parch  fare embarked  survived
911  912       2    male  40.0      0      0  16.0        S         0
912  913       3    male   NaN      0      0   7.8        Q         0
913  914       1    male  42.0      0      0  26.6        S         0
914  915       3  female  27.0      1      0   7.9        S         0
915  916       3    male  25.0      1      0   7.8        S         1

## Generate a summary

### 1.Summary of missing values

In [5]:
# Check for missing values in the dataframe and calculate the sum of missing values for each column
missingValues = data.isnull().sum()

In [6]:
#Displaying the number of missing values
missingValues

ID            0
pclass        0
sex           0
age         188
sibsp         0
parch         0
fare          9
embarked      0
survived      0
dtype: int64

### 2.Percentage of missing values

In [7]:
# Calculate the percentage of missing values for each column in the dataframe
percentMissingValues = data.isnull().sum()/len(data)*100

### 3.Inconsistent Values (IV)

In [8]:
# Calculate the number of unique categories in the 'ID' column
id_cat = len(data['ID'].unique())

# Calculate the number of unique categories in the 'pclass' column
pclass_cat = len(data['pclass'].unique())

# Calculate the number of unique categories in the 'sex' column
sex_cat = len(data['sex'].unique())

# Calculate the number of unique categories in the 'embarked' column
embarked_cat = len(data['embarked'].unique())

# Calculate the number of unique categories in the 'survived' column
survived_cat = len(data['survived'].unique())

In [9]:
#Checking the value of survived_cat
survived_cat

2

In [10]:
#Checking the value of pclass_cat
pclass_cat

3

In [11]:
# Create a Series to represent inconsistent values for specific columns
InconsistentValues = pd.Series({"ID": id_cat - len(data), 
                                "pclass": pclass_cat - 3 , 
                                "sex": sex_cat - 2,
                                "age": np.nan,  # Set the 'Age' column to NaN (missing value)
                                "sibsp": np.nan,  # Set the 'sibso' column to NaN (missing value)
                                "parch": np.nan,  # Set the 'parch' column to NaN (missing value)
                                "fare": np.nan, # Set the 'Salary' column to NaN (missing value)
                                "embarked": embarked_cat - 3, # Set the 'embarked' column to a specific value (embarked_cat - 3)
                                "survived": survived_cat - 2 # Set the 'survived' column to a specific value (survived_cat - 2)
                               }
                              )

### 4.Percentage of Inconsistent Values (IV/n)

In [12]:
# Calculate the percentage of inconsistent values in each column
percentInconsistentValues = InconsistentValues / len(data) * 100

In [13]:
#Check the values
percentInconsistentValues

ID          0.000000
pclass      0.000000
sex         0.218341
age              NaN
sibsp            NaN
parch            NaN
fare             NaN
embarked    0.109170
survived    0.000000
dtype: float64

### 5.Summary

In [14]:
# Concatenate and create a summary dataframe
dataSummary = pd.concat([missingValues, percentMissingValues, InconsistentValues, percentInconsistentValues], axis = 1)

In [15]:
# Assign descriptive column names to the data summary dataframe
dataSummary.columns = ['Missing Values', '% of Missing Values', 'Inconsistent Values', '% of Inconsistent Values']

In [16]:
#Display the dataframe
dataSummary

,Missing Values,% of Missing Values,Inconsistent Values,% of Inconsistent Values
ID,0,0.000000,0.0,0.000000
pclass,0,0.000000,0.0,0.000000
sex,0,0.000000,2.0,0.218341
age,188,20.524017,NaN,NaN
sibsp,0,0.000000,NaN,NaN
parch,0,0.000000,NaN,NaN
fare,9,0.982533,NaN,NaN
embarked,0,0.000000,1.0,0.109170
survived,0,0.000000,0.0,0.000000

## Handle the missing values

In [17]:
# Calculate Pearson correlation between columns
correlation_matrix = data.corr()

# Display the correlation matrix
print(correlation_matrix)

                ID    pclass       age     sibsp     parch      fare  survived
ID        1.000000  0.016453  0.008882  0.008219  0.040224 -0.007805 -0.017937
pclass    0.016453  1.000000 -0.386801  0.069037  0.035001 -0.543287 -0.313447
age       0.008882 -0.386801  1.000000 -0.237155 -0.165252  0.172512 -0.085332
sibsp     0.008219  0.069037 -0.237155  1.000000  0.391398  0.184081 -0.022894
parch     0.040224  0.035001 -0.165252  0.391398  1.000000  0.228566  0.078399
fare     -0.007805 -0.543287  0.172512  0.184081  0.228566  1.000000  0.245335
survived -0.017937 -0.313447 -0.085332 -0.022894  0.078399  0.245335  1.000000

C:\Users\shresthad\AppData\Local\Temp\ipykernel_43536\1887613145.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  correlation_matrix = data.corr()

'pclass' and 'sibsp' have the highest correlations with age. We will use both of these features to impute the missing values of 'age'.

### Age

In [18]:
# Calculate the mean (average) value of the 'age' column
data['age'].mean()

29.381753708791205

In [19]:
# Group data by 'pclass' and 'sibsp'
groupedData = data.groupby(['pclass','sibsp'])

In [20]:
# Calculate the mean age for each group of 'pclass' and store the result
impute_for_age = groupedData['age'].mean()

In [21]:
#Display the different 'age' mean values corresponding to each subgroup of 'pclass' and  'sibsp'
impute_for_age

pclass  sibsp
1       0        38.172897
        1        39.705556
        2        40.600000
        3        23.500000
2       0        29.907407
        1        27.092448
        2        16.333333
        3        30.000000
3       0        27.049082
        1        23.334636
        2        21.288462
        3        11.555556
        4         8.400000
        5        10.200000
        8        14.500000
Name: age, dtype: float64

In [22]:
# Impute missing ages based on 'pclass' and 'sex'
for (pclass, sibsp), age in impute_for_age.items():
    data.loc[(data['age'].isnull()) & (data['pclass'] == pclass) & (data['sibsp'] == sibsp), 'age'] = age

In [23]:
#Display the data
data

      ID  pclass     sex        age  sibsp  parch  fare embarked  survived
0      1       3    male  20.000000      0      0   4.0        C         0
1      2       3  female  18.000000      0      0   7.2        C         1
2      3       2    male  29.907407      0      0  15.6        C         0
3      4       2    male  29.907407      0      0   0.0        S         0
4      5       3  female   2.000000      3      2  27.9        S         0
..   ...     ...     ...        ...    ...    ...   ...      ...       ...
911  912       2    male  40.000000      0      0  16.0        S         0
912  913       3    male  27.049082      0      0   7.8        Q         0
913  914       1    male  42.000000      0      0  26.6        S         0
914  915       3  female  27.000000      1      0   7.9        S         0
915  916       3    male  25.000000      1      0   7.8        S         1

[916 rows x 9 columns]

In [24]:
#Check that all missing values for 'age' are imputed 
data.isnull().sum()

ID          0
pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        9
embarked    0
survived    0
dtype: int64

### fare

In [25]:
#Repeat the same steps for 'fare' column
# Group data by 'pclass' 
groupedData2 = data.groupby(['pclass'])

In [26]:
#Calculate the mean salary for each group of 'pclass' and store the result
impute_for_fare = groupedData2['fare'].mean()

In [27]:
impute_for_fare

pclass
1    87.178302
2    20.902941
3    13.523014
Name: fare, dtype: float64

In [28]:
impute_for_fare[1]

87.17830188679245

In [29]:
# Update missing 'Salary' values for individuals in each country based on the calculated mean age for the 'survived' group
data.loc[data.pclass == 1, 'fare'] = data.loc[data.pclass == 1, 'fare'].fillna(impute_for_fare[1])
data.loc[data.pclass == 2, 'fare'] = data.loc[data.pclass == 2, 'fare'].fillna(impute_for_fare[2])
data.loc[data.pclass == 3, 'fare'] = data.loc[data.pclass == 3, 'fare'].fillna(impute_for_fare[3])

In [30]:
#Check that all missing values for 'fare' are imputed 
data.isnull().sum()

ID          0
pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
survived    0
dtype: int64

## Correct the data inconsistency issue.

### sex column

In [31]:
# Check the variations of the 'sex' values
data.sex.unique()

array(['male', 'female', 'Male', 'Female'], dtype=object)

In [32]:
# Iterate through the rows of the dataframe
for i in range(len(data)):
    if data.loc[i,'sex'] == 'Male':  # Check if the value in the 'sex' column is "Male"
        data.loc[i,'sex'] = 'male' # If it is "Male", update the value to 'male'
    elif data.loc[i,'sex'] == 'Female':  # Check if the value in the 'sex' column is "Female
        data.loc[i,'sex'] = 'female' # If it is "Female", update the value to 'female'

### Embarked column

In [33]:
# Check the variations of the 'embarked' values
data.embarked.unique()

array(['C', 'S', 'Q', 'Queenstown'], dtype=object)

In [34]:
# Iterate through the rows of the dataframe
for i in range(len(data)):
    if data.loc[i,'embarked'] == 'Queenstown':  # Check if the value in the 'embarked' is "Queenstown"
        data.loc[i,'embarked'] = 'Q' # If it is "Queenstown", update the value to 'Q'

In [35]:
#Display the data
data

      ID  pclass     sex        age  sibsp  parch  fare embarked  survived
0      1       3    male  20.000000      0      0   4.0        C         0
1      2       3  female  18.000000      0      0   7.2        C         1
2      3       2    male  29.907407      0      0  15.6        C         0
3      4       2    male  29.907407      0      0   0.0        S         0
4      5       3  female   2.000000      3      2  27.9        S         0
..   ...     ...     ...        ...    ...    ...   ...      ...       ...
911  912       2    male  40.000000      0      0  16.0        S         0
912  913       3    male  27.049082      0      0   7.8        Q         0
913  914       1    male  42.000000      0      0  26.6        S         0
914  915       3  female  27.000000      1      0   7.9        S         0
915  916       3    male  25.000000      1      0   7.8        S         1

[916 rows x 9 columns]

In [36]:
# Check the new variations of the 'embarked' values
data.embarked.unique()

array(['C', 'S', 'Q'], dtype=object)

### Save the data

In [37]:
# Store the clean data in a CSV file. 
data.to_csv('Cleaned_TitanicData.csv', index= False)